<h1 style='color: green;'><center>Question 50 <br> Machine Learning</center></h1>

<h3>Q1 What is the differnece between Series & Dataframe.</h3>
<p><B>Answer</B></p>
Following are the difference between Series and dataframe.
  <table>
        <tr>
            <th>Feature</th>
            <th>Series</th>
            <th>DataFrame</th>
        </tr>
        <tr>
            <td>Dimensionality</td>
            <td>One-dimensional (single column)</td>
            <td>Two-dimensional (rows and columns)</td>
        </tr>
        <tr>
            <td>Data Type Homogeneity</td>
            <td>All elements must have the same data type</td>
            <td>Columns can have different data types (int, string, etc.)</td>
        </tr>
        <tr>
            <td>Size Mutability</td>
            <td>Immutable (size cannot be changed)</td>
            <td>Mutable (size can be dynamically changed)</td>
        </tr>
        <tr>
            <td>Use Cases</td>
            <td>Simple data sequences, univariate analysis</td>
            <td>Tabular data, relational data, multivariate analysis</td>
        </tr>
    </table>

<h3>Q2 Create a database name Travel_Planner in mysql, and create a table name bookings in that which having attributes (user_id INT, flight_id INT, hotel_id INT, activity_id INT, booking_date DATE). Fill with some dummy values. Now you have to read the content as pandas dataframe and display the output.</h3>

In [6]:
## Example
## We already create a database named Travel_Planner and a table named with bookings with dummy values.

import sqlite3 as sql
import pandas as pd

database=sql.connect('Travel_Planner.db')
cursor=database.cursor()

query=f"SELECT * FROM bookings"
df=pd.read_sql_query(query, database)

# Commiting and closing the connection from the database.
database.commit()
database.close()

# Displaying the dataframe.
df

   user_id  flight_id  hotel_id  activity_id booking_date
0        1       3462       465          789   2024-07-10
1        2       4564       675          246   2024-07-12
2        3       6436       263          465   2024-07-08
3        4       3642       783          674   2024-07-09

<h3>Q3 Difference between loc and iloc.</h3>
<p><b>Answer</b></p>

# loc
- Selects data based on labels (row and/or column names) in the DataFrame's index or columns.
Useful when you know the specific labels of the data you want to access.
# iloc
- Selects data based on integer positions within the DataFrame.
Useful when you know the exact numerical positions of the rows and columns you need.